apache/nuttx/arch/arm/src/common/stm32/stm32_hrtim_m3m4_v1.h
struct hrtim_dev_s;
struct stm32_hrtim_ops_s
{
  int      (*cmp_update)(struct hrtim_dev_s *dev, uint8_t timer,
                         uint8_t index, uint16_t cmp);
  int      (*per_update)(struct hrtim_dev_s *dev,
                         uint8_t timer, uint16_t per);
  int      (*rep_update)(struct hrtim_dev_s *dev,
                         uint8_t timer, uint8_t rep);
  uint16_t (*per_get)(struct hrtim_dev_s *dev, uint8_t timer);
  uint16_t (*cmp_get)(struct hrtim_dev_s *dev, uint8_t timer,
                      uint8_t index);
  uint64_t (*fclk_get)(struct hrtim_dev_s *dev, uint8_t timer);
  int      (*soft_update)(struct hrtim_dev_s *dev, uint8_t timer);
  int      (*soft_reset)(struct hrtim_dev_s *dev, uint8_t timer);
  int      (*freq_set)(struct hrtim_dev_s  *dev, uint8_t timer,
                                 uint64_t freq);
  int      (*tim_enable)(struct hrtim_dev_s  *dev, uint8_t timers,
                         bool state);

#ifdef CONFIG_STM32_HRTIM_INTERRUPTS
  int      (*irq_ack)(struct hrtim_dev_s *dev,
                      uint8_t timer, int source);
  uint16_t (*irq_get)(struct hrtim_dev_s *dev, uint8_t timer);
#endif
#ifdef CONFIG_STM32_HRTIM_PWM
  int      (*outputs_enable)(struct hrtim_dev_s *dev, uint16_t outputs,
                             bool state);
  int      (*output_set_set)(struct hrtim_dev_s *dev, uint16_t output,
                              uint32_t set);
  int      (*output_rst_set)(struct hrtim_dev_s *dev, uint16_t output,
                              uint32_t rst);
#endif
#ifdef CONFIG_STM32_HRTIM_BURST
  int      (*burst_enable)(struct hrtim_dev_s *dev, bool state);
  int      (*burst_cmp_set)(struct hrtim_dev_s *dev, uint16_t cmp);
  int      (*burst_per_set)(struct hrtim_dev_s *dev, uint16_t per);
  int      (*burst_pre_set)(struct hrtim_dev_s *dev, uint8_t pre);
  uint16_t (*burst_cmp_get)(struct hrtim_dev_s *dev);
  uint16_t (*burst_per_get)(struct hrtim_dev_s *dev);
  int      (*burst_pre_get)(struct hrtim_dev_s *dev);
#endif
#ifdef CONFIG_STM32_HRTIM_CHOPPER
  int      (*chopper_enable)(struct hrtim_dev_s *dev, uint8_t timer,
                             uint8_t chan, bool state);
#endif
#ifdef CONFIG_STM32_HRTIM_DEADTIME
  int      (*deadtime_update)(struct hrtim_dev_s *dev, uint8_t timer,
                              uint8_t dt, uint16_t value);
  uint16_t (*deadtime_get)(struct hrtim_dev_s *dev, uint8_t timer,
                           uint8_t dt);
#endif
#ifdef CONFIG_STM32_HRTIM_CAPTURE
  uint16_t (*capture_get)(struct hrtim_dev_s *dev, uint8_t timer,
                          uint8_t index);
  int      (*soft_capture)(struct hrtim_dev_s *dev, uint8_t timer,
                           uint8_t index);

#endif
};

/* HRTIM device structure */

struct hrtim_dev_s
{
#ifdef CONFIG_STM32_HRTIM
  /* Fields managed by common upper half HRTIM logic */

  uint8_t hd_ocount; /* The number of times the device has been opened */
#endif

  /* Fields provided by lower half HRTIM logic */

  const struct stm32_hrtim_ops_s *hd_ops; /* HRTIM operations */
  void *hd_priv;                          /* Used by the arch-specific logic */
  bool initialized;                       /* true: HRTIM driver has been initialized */
};

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifndef __ASSEMBLY__
#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

/****************************************************************************
 * Name: stm32_hrtiminitialize
 *
 * Description:
 *   Initialize the HRTIM.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *   Valid HRTIM device structure reference on success; a NULL on failure.
 *
 * Assumptions:
 *   1. Clock to the HRTIM block has enabled,
 *   2. Board-specific logic has already configured
 *
 ****************************************************************************/

struct hrtim_dev_s *stm32_hrtiminitialize(void);

/****************************************************************************
 * Name: hrtim_register
 ****************************************************************************/

#ifndef CONFIG_STM32_HRTIM_DISABLE_CHARDRV
int hrtim_register(const char *path, struct hrtim_dev_s *dev);
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif
#endif /* __ASSEMBLY__ */

#endif /* CONFIG_STM32_HRTIM1 */
#endif /* __ARCH_ARM_SRC_COMMON_STM32_STM32_HRTIM_H */
